[
  {
    "title": "Renewables soar, but fossil fuels continue to rise as global electricity demand hits record levels",
    "url": "https://kpmg.com/xx/en/media/press-releases/2025/06/statistical-review-of-world-energy.html",
    "text": "The Energy Institute (EI), in collaboration with Kearney and KPMG, today released the 74th edition of the Statistical Review of World Energy, offering the first complete look at global energy data for 2024.\n\nIn a year when average air temperatures consistently breached the 1.5°C warming threshold, global CO₂-equivalent emissions from energy rose by 1%, marking yet another record, the fourth in as many years.\n\nWind and solar energy alone expanded by an impressive 16% in 2024, nine times faster than total energy demand. Yet this growth did not fully counterbalance rising demand elsewhere, with total fossil fuel use growing by just over 1%, highlighting a transition defined as much by disorder as by progress.\n\nCrude oil demand in OECD countries remained flat, following a slight decline in the"
  },
  {
    "title": "Universe was not formed in big bang but ‘bounced’ out of black hole - new study",
    "url": "https://www.irishexaminer.com/world/arid-41658845.html",
    "text": "The Universe may not have started with the Big Bang, but instead “bounced” out of a massive black hole formed within a larger “parent” universe, according to a new scientific paper.\n\nProfessor Enrique Gaztanaga, from the University of Portsmouth’s Institute of Cosmology and Gravitation, said that the current Big Bang theory was problematic as the laws of physics “broke down” when used to explain it.\n\nHis new explanation, published in the journal Physical Review D, suggests that the Universe was formed as a result of a gravitational collapse in a larger universe which generated a massive black hole leading to a rebound or “bounce” causing our universe to emerge.\n\nOne of the strengths of this model is that it makes predictions that can be thoroughly tested\n\nProfessor Gaztanaga said: “The Big"
  },
  {
    "title": "Life of a GP ‘a great privilege’",
    "url": "https://www.westmeathindependent.ie/2025/06/26/life-of-a-gp-a-great-privilege/",
    "text": "Dr Mark McCormick. Photo: Paul Molloy\n\nLife of a GP ‘a great privilege’\n\nThe relationship between a patient and their GP is one that can last a lifetime, and recently-retired GP Dr Mark McCormick has described it as privilege to know people for that length of time.\n\n\"It's a great privilege, the duration, the length of time of the relationship. I have known people since they were born and since their children have arrived and seen another generation. The trans-generational contact is really unusual and very rewarding and gratifying. It's a pleasure and a privilege to know people on that type of longevity,\" he said.\n\n\"You don't get that rapport in hospital medicine. In some medical disciplines you can build a relationship with patients, but nothing is quite like family medicine and general p"
  },
  {
    "title": "Light Pollution Shown To Negatively Some Static Marine",
    "url": "https://www.marinetechnologynews.com/news/light-pollution-shown-negatively-650418",
    "text": "A new study reveals harmful influence of artificial light at night on the immobile species, the snakelocks anemone.\n\nThe study, \"The disruption of a symbiotic sea anemone by light pollution: Non-linear effects on zooxanthellae and molecular indicators,\" was published in Science of the Total Environment and is a collaborative effort between the University of Prince Edward Island, Plymouth Marine Laboratory and the University of Exeter.\n\nThe issue of artificial light at night (ALAN) is rapidly growing in prominence. However, there are still significant research gaps before there is a good understanding of how a range of marine organisms are impacted by ALAN, especially when combined with other stressors.\n\nIt is important to understand these impacts not only in light of the multiple pressures"
  },
  {
    "title": "I've heard JLab's new range of Bluetooth speakers - designed to light up your party for less",
    "url": "https://www.whathifi.com/speakers/wireless-speakers/ive-heard-jlabs-new-range-of-bluetooth-speakers-designed-to-light-up-your-party-for-less",
    "text": "JLab has unveiled a host of new Bluetooth speakers in a bid to muscle in on the portable audio market.\n\nOffering four models which combine well-specced feature sets with LED lighting and competitive prices, JLab's new range could appeal to users looking for party-ready speakers that won't leave them bankrupt.\n\nLet's start with the smallest of the group, the JLab Pop Party.\n\nBilled as the brand's portable, low-cost option, the Pop Party is roughly the size of JBL's five-star Go 4 rival, a five-watt speaker with a 5cm radiator at the base of the unit for pumping out those lower-end frequencies.\n\nThe titchy new unit offers 8 hours of playtime from a single charge, while an IPX5 waterproof rating should keep it protected from the elements when you're on the go.\n\nThere's also a small carry loop"
  },
  {
    "title": "Microsoft launches Mu AI model for smart local tasks on Windows PCs",
    "url": "https://www.livemint.com/technology/microsoft-launches-mu-ai-model-for-smart-local-tasks-on-windows-pcs-11750951810493.html",
    "text": "Microsoft has rolled out a small AI model called Mu that runs locally on Copilot+ PCs. It is designed to give users fast and accurate help by using the device’s Neural Processing Unit instead of relying on cloud servers. Mu already supports the Windows Settings app for users in the Windows Insider Dev Channel. You can type natural language queries like \"turn on night light,\" and Mu understands and responds in real time.\n\nWhat makes Mu special? The model has 330 million parameters and uses a Transformer encoder-decoder setup. This allows it to process input and output separately, which leads to better speed and lower delay. Microsoft claims that Mu generates more than 100 tokens per second and has much lower latency than other models of its size.\n\nMu was trained using Azure A100 GPUs and tu"
  },
  {
    "title": "A star exploded in the Lupus constellation. Here's how to see the nova in the night sky this month",
    "url": "https://www.space.com/stargazing/a-star-exploded-in-the-lupus-constellation-heres-how-to-see-the-nova-in-the-night-sky-this-month",
    "text": "The nova V462 Lupi is visible through binoculars and found in the Lupus constellation.\n\nAn ordinarily dim star is making a brilliant appearance in the night sky after unleashing a powerful nova explosion, which has rendered it visible to the naked eye.\n\nThe nova V462 Lupi was first discovered on June 12 by the Ohio State University-led All-Sky Automated Survey for Supernovae (ASAS-SN), as reported by Sky & Telescope. The star that spawned the nova is usually too dim to see with the naked eye, boasting an apparent brightness — or magnitude — of +22.3.\n\nHowever, the explosion of radiation thrown out by the nova caused it to brighten dramatically, making it appear as if a new star is shining in the night sky!\n\nNova Lup 2025 (V462 Lupi) via @TelescopeLiveHQ (imaged on June 20, 2025. Unfiltered"
  },
  {
    "title": "Space-grown muscle tissues reveal rapid aging-like decline in microgravity",
    "url": "https://phys.org/news/2025-06-space-grown-muscle-tissues-reveal.html",
    "text": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nGreen: Viability of live muscle tissue (Calcein AM staining, 4×). Red: Sarcomere striation formation within myotubes (α-Actinin staining, 20×). Blue: Muscle cell nuclei within myotubes (DAPI staining, 20×). Credit: Maddalena Parafati (Malany's Lab)\n\nSarcopenia, which is a progressive and extensive decline in muscle mass and strength, is common with aging and is estimated to affect up to 50% of people aged 80 and older. It can lead to disability and injuries from falls and is associated with a lower quality of life and increased mortality. Apart from lifestyle changes, there is no current clinical treatment for"
  },
  {
    "title": "Space Station's Lab-on-Chip Model Uncovers How Microgravity Drives Muscle Degeneration",
    "url": "https://www.genengnews.com/topics/translational-medicine/space-stations-lab-on-chip-model-uncovers-how-microgravity-drives-muscle-degeneration/",
    "text": "3D Donor-Derived Skeletal Muscle Tissue in custom microfluidic device compatible with spaceflight hardware [Maddalena Parafati (Malany`s Lab)]\n\nSpace exploration activity has been increasing. In turn, researchers are more interested than ever in uncovering more about how space travel affects human health and the progression of disease. Although it is known that microgravity accelerates skeletal muscle degeneration, the effects of space on muscle cell function remain unclear.\n\nSpace flight with the associated absence of gravity and limited strain on muscles causes muscle weakness within a short period of time, providing a time-lapse view of age-related atrophy-associated changes in the muscle. To understand the changes of muscle in microgravity, researchers from the University of Florida en"
  },
  {
    "title": "Press release: Fashion sector shows progress in climate strategies, but falls short on key transitions - report",
    "url": "https://newclimate.org/news/press-release-fashion-sector-shows-progress-in-climate-strategies-but-falls-short-on-key",
    "text": "While some fashion companies have made progress in their climate strategies, the lack of critical transition measures and reliance on false solutions like biomass and fossil gas undermine the integrity of their efforts, according to the new analysis by the 2025 Corporate Climate Responsibility Monitor (CCRM), released today by NewClimate Institute in collaboration with Carbon Market Watch.\n\nThis year’s fashion deep dive of the 2025 CCRM, in its fourth edition, assesses five major global fashion companies – Adidas, H&M, Inditex, Lululemon and Shein – focusing on how well they align with the major transitions needed to reduce their sector’s carbon footprint. The full report, which evaluates the climate strategies of 55 companies across various sectors, will be released in early July.\n\nDespit"
  },
  {
    "title": "Bechtel Celebrates Early Construction Completion of Western Sydney International Airport",
    "url": "https://www.bechtel.com/press-releases/bechtel-celebrates-early-construction-completion-of-western-sydney-international-airport/",
    "text": "This website uses cookies and other tracking technologies to enhance navigation, facilitate feedback, analyze usage of our products and services, support marketing efforts, and deliver third-party content. View our Privacy Policy.\n\nThe Bechtel-built mine, one of the largest copper resources, features a first-of-its-kind desalination plant and will operate on 100% renewable energy by 2025.\n\nInnovative Battery Manufacturing Facilities Construction management consultancy for building innovative battery manufacturing facilities in the United States. Bechtel is at the forefront of constructing innovative battery manufacturing facilities in the U.S. Our expert team ensures compliance with local codes and…\n\nOur colleagues around the world share why they chose to build their careers with Bechtel."
  },
  {
    "title": "Risk science brings reliability to changing energy grids",
    "url": "https://engineering.princeton.edu/news/2025/06/26/risk-science-brings-reliability-changing-energy-grids",
    "text": "Drawing on techniques used to minimize risk in financial markets, a Princeton-led team is creating software to help solve the challenge of integrating renewable energy into the electric grid without sacrificing grid reliability.\n\nThe effort aims to solve two distinct but connected problems — grid operators’ ability to smoothly shift operations when clouds or changing winds impact renewable energy outputs, and planners’ long-term decisions on how to balance renewables and other power sources in expanding the grid to meet increasing demand.\n\nBanks are required to report risk measurements for sets of investments — for example, that they have a 5% probability of losing $200 million overnight — and to attribute that risk to specific assets or traders. “That’s the risk allocation problem,” said"
  },
  {
    "title": "Bugonia: first trailer for new Emma Stone and Yorgos Lanthimos collaboration",
    "url": "https://www.theguardian.com/film/2025/jun/26/bugonia-first-trailer-emma-stone-yorgos-lanthimos",
    "text": "The first trailer for Bugonia has arrived, offering a first look at the latest collaboration between Yorgos Lanthimos and Emma Stone.\n\nThe acclaimed Greek film-maker and the American actor have previously worked on The Favourite, Poor Things and, most recently, Kinds of Kindness. The relationship has netted Stone an Oscar nomination and a win.\n\nBugonia is a remake of the 2003 sci-fi comedy Save the Green Planet! from South Korean director Jang Joon-hwan. It tells the story of two conspiracy-obsessed men who kidnap the high-powered CEO of a corporation convinced she is a dangerous alien. Stone is joined by her Kinds of Kindness co-star Jesse Plemons while Alicia Silverstone and comedian Stavros Halkias also appear.\n\nThe film is also produced by Hereditary and Midsommar director Ari Aster, w"
  },
  {
    "title": "Idris, Aaron, Theo? Tell us who should be the next James Bond",
    "url": "https://www.theguardian.com/film/2025/jun/26/who-should-be-the-next-james-bond",
    "text": "After months of speculation (names like Alfonso Cuarón, Danny Boyle and Edward Berger were all thrown around), Dune’s Denis Villeneuve has now been confirmed as the first director of the new James Bond era.\n\nIt’s not as if it’s ever been an easy job but it’s likely never been quite this hard. Not only must Villeneuve contend with new Bond bosses at Amazon eager to scatter click-to-buy links throughout action set pieces but he’s also going to introduce an entirely new 007.\n\nBut who will that be? Rumours have suggested names such as Aaron Taylor-Johnson, Tom Hardy, Idris Elba, Aaron Pierre, Theo James and James Norton but without any firm intel to go on, it’s anyone’s guess.\n\nTaylor-Johnson fueled speculation at the recent premiere for 28 Years Later when he was asked, “What are you doing ne"
  },
  {
    "title": "Denis Villeneuve to direct the next 'James Bond' movie",
    "url": "https://www.cnbc.com/2025/06/26/denis-villeneuve-to-direct-the-next-james-bond-movie.html",
    "text": "(L-R) Tanya Lapointe and Denis Villeneuve attend the 2025 Vanity Fair Oscar Party Hosted By Radhika Jones at Wallis Annenberg Center for the Performing Arts on March 02, 2025 in Beverly Hills, California.\n\nOscar-nominated Denis Villeneuve will direct the next \"James Bond\" film, Amazon's MGM Studios said on Wednesday, taking charge of one of Hollywood's most enigmatic spies and longest-running movie series.\n\nVilleneuve, the Canadian film director and writer, has earned critical acclaim for films such as \"Sicario,\" \"Dune,\" \"Dune: Part Two,\" \"Blade Runner 2049,\" and \"Arrival\".\n\nHe was nominated for Best Director at the 2017 Oscars for sci-fi film \"Arrival\", which starred Amy Adams and Jeremy Renner, and for Best Adapted Screenplay for \"Dune\", based on author Frank Herbert's highly acclaimed 1"
  },
  {
    "title": "Cédrine Kerbaol wins French national time trial championships",
    "url": "https://efprocycling.com/racing/cedrine-kerbaol-wins-french-TT-championships/",
    "text": "The win was Cedrine’s second national time trial championship victory after she also won the title back in 2023.\n\nJuliette Labous had set the time to beat, but Cédrine was measured throughout the individual test and set the quickest time at the intermediate checks at 7km and 17.6km. On the final climb to the line, she gave it everything she had to take a resounding win and EF Education-Oatly’s ninth win of the season.\n\n“That feels really good. It feels good to get the title again,” a delighted Cédrine said at the finish. “I gave everything, and I don’t have any regrets, and that’s a very good conclusion for today after the months that I have spent working for this. I’m really happy. I went full gas from the beginning. My radio didn’t work, so I couldn’t get the nice information from Emma T"
  },
  {
    "title": "U23, U17 Asian Wrestling Championships 2025: India finish with 35 medals - know winners",
    "url": "https://www.olympics.com/en/news/u23-u17-asian-wrestling-championships-2025-india-medal-winners",
    "text": "Indian wrestlers wrapped up a successful campaign at the U23 and U17 Asian Wrestling Championships 2025 in Vung Tau, Vietnam, bagging a total of 35 medals - 18 gold, 10 silver and seven bronze - across both age groups.\n\nThe continental competition was held from June 18 to 26, featuring 60 Indian wrestlers across men’s and women’s freestyle and Greco-Roman categories. Each age group had 10 weight categories per format, with India fielding one wrestler per category.\n\nThe U23 championships ran from June 18 to 21. India’s women dominated, winning a medal in all 10 categories - four gold, five silver and one bronze - to clinch the team title."
  },
  {
    "title": "LPGA, Dow launch prestigious new award celebrating character, community impact",
    "url": "https://www.pgatour.com/article/news/latest/2025/06/26/lpga-dow-launch-prestigious-new-award-celebrating-character-community-impact",
    "text": "DAYTONA BEACH, Fla., and MIDLAND, Mich. – The Ladies Professional Golf Association (LPGA) and Dow announced Thursday the creation of the Dow Impact Award, a prestigious new annual platform that recognizes the gold standard in professional sports: ath... [322 chars]"
  },
  {
    "title": "Hegseth defends Iran strike amid doubts over Trump’s ‘obliteration’ claims",
    "url": "https://www.theguardian.com/us-news/2025/jun/26/hegseth-iran-nuclear-strike-intel",
    "text": "The US secretary of defense, Pete Hegseth, has defended the US strikes on Iranian nuclear enrichment facilities and said that Donald Trump had “decimated … obliterated” the country’s nuclear program despite initial intelligence assessments that last week’s strikes had failed to destroy key enrichment facilities and they could resume operations within just months.\n\nBut he and the chairman of the joint chiefs of staff, Gen Dan Caine, largely based that assessment on AI modeling, showing test videos of the bunker buster bombs used in the strikes and referred questions on a battle damage assessment of Fordow to the intelligence community.\n\nSpeaking from the Pentagon briefing room, Hegseth cast doubt on an initial assessment from the Defense Intelligence Agency, noting it was “preliminary” and"
  },
  {
    "title": "AI Reveals How Your Words Reflect Personality",
    "url": "https://neurosciencenews.com/ai-personality-words-29353/",
    "text": "Summary: Researchers have shown that AI can detect personality traits from written text and, crucially, now understand how these models make decisions. By applying explainable AI techniques like integrated gradients, the team uncovered how specific words and linguistic patterns contribute to predictions based on major psychological frameworks.\n\nThe study found that Big Five traits are more reliably detected than MBTI types, with the former aligning better with linguistic markers of behavior. These insights may pave the way for transparent, ethical personality assessments in psychology, HR, education, and digital platforms.\n\nKey Facts:\n\nExplainable AI: Integrated gradients were used to uncover which words influenced personality predictions, opening the “black box” of AI decision-making.\n\nIn"
  },
  {
    "title": "Heat alerts issued for most of England as temperatures above 30C forecast again",
    "url": "https://www.theguardian.com/uk-news/2025/jun/26/heat-health-alerts-england-ukhsa-temperatures-weather",
    "text": "An amber heat health alert has been issued for much of England because of predicted temperatures above 30C (86F) over the weekend.\n\nThe alert, issued by the UK Health Security Agency (UKHSA), covers London, the East Midlands, and the south-west, south-east and east of England.\n\nIt is due to come into force at midday on Friday and will remain in place until 6pm on Tuesday. A yellow alert has also been issued for Yorkshire and the Humber, and the West Midlands.\n\nThe UKHSA alert system, developed in partnership with the Met Office, is designed to issue early warnings about weather-related health risks.\n\nAn amber alert – the second highest warning level – indicates that hot weather is likely to be felt across the whole health service, with the UKHSA warning this could have a significant impact"
  },
  {
    "title": "Ethiopian embassy, UN Pakistan collaborate for food systems summit",
    "url": "https://www.app.com.pk/national/ethiopian-embassy-un-pakistan-collaborate-for-food-systems-summit-2/",
    "text": "- Advertisement -\nISLAMABAD, Jun 26 (APP): The Ethiopian Embassy in Islamabad and the United Nations, Pakistan, have agreed to cooperate on mobilizing international participation for the 2nd United Nations Food Systems Summit Stocktake, taking place ... [1379 chars]"
  },
  {
    "title": "UK weather: Amber heat health alert issued for England ahead of potentially the hottest June day on record",
    "url": "https://news.sky.com/story/uk-weather-amber-heat-health-alert-issued-ahead-of-potentially-the-hottest-june-day-on-record-13388830",
    "text": "An amber heat health alert has been issued for some parts of England - days before what could be the hottest June day on record.\n\nSky News weather producer Joanna Robinson said highs of 34C are possible on Monday - with a 20% chance of beating the hottest day in June record of 35.6C from 1976.\n\nThe likelihood of a record-breaking temperature on Monday could increase over the weekend as the day approaches.\n\nIf the temperature does exceed 35.6C it would make it the hottest start to Wimbledon ever - with the world-famous tennis tournament beginning on Monday.\n\nThe highest temperature for the opening day of the tournament so far came on 25 June 2001, with 29.3C at Kew Gardens.\n\nHeatwave criteria are likely to be met in a few places on Sunday and Monday, mainly across parts of central and easte"
  },
  {
    "title": "UNSW Engineers Help Crack Key Challenge In Scaling Quantum Computers",
    "url": "https://www.miragenews.com/unsw-engineers-help-crack-key-challenge-in-1485145/",
    "text": "Quantum computing engineers have brought the world a step closer to building practical, large-scale quantum computers.\n\nUNSW Sydney quantum engineers, in collaboration with University of Sydney scientists, have developed new technology that effectively reduces the size of the circuits required to run a silicon-based quantum computer.\n\nThe move paves the way for more quantum information to be packed into a smaller footprint.\n\nThe work is part of a partnership between two startups - UNSW spinout Diraq and University of Sydney startup Emergence Quantum .\n\nThe milestone, published in Nature , is a crucial step towards integrating Diraq's silicon 'quantum dot' technology with the mature processes of the semiconductor industry to achieve utility-scale quantum computers that can tackle problems w"
  },
  {
    "title": "3 Multibagger stocks to watch as Europe rearms and India ramps up defence spending",
    "url": "https://www.financialexpress.com/market/stock-insights/3-multibagger-stocks-to-watch-as-europe-rearms-and-india-ramps-up-defence-spending/3891574/",
    "text": "Europe is rearming, and India is doubling down on its defence commitments. In response to rising geopolitical tensions, Europe recently unveiled the ReArm Europe Plan—its most ambitious push to strengthen its military capabilities.\n\nAt the same time, India continues to scale up its defence budget, with a growing focus on indigenisation and export potential. According to ICICI Securities, this twin push—one global, the other domestic—could support a more sustained order flow for Indian defence manufacturers. For investors, this raises the question: which listed companies stand to benefit from this changing landscape?\n\nALSO READ 3 Defence stocks with fresh breakout on charts\n\nIn their report, ICICI Securities highlighted three stocks. Let’s dig into these stocks that could be worth tracking"
  },
  {
    "title": "Equitable Bank CEO Andrew Moor dies at 65",
    "url": "https://www.theglobeandmail.com/business/article-equitable-bank-ceo-andrew-moor-death/",
    "text": "Open this photo in gallery: Andrew Moor, CEO of EQ Bank, in 2023. Mr. Moor died at age 65 over the weekend, the bank said on Tuesday.Chris Young/The Canadian Press\n\nEquitable Bank chief executive officer Andrew Moor – who built Canada’s largest challenger to the Big Six banks – died unexpectedly over the weekend at age 65.\n\nMr. Moor, who led EQ Bank as CEO for 18 years, was known for growing the lender into a major national business, and for recognizing and developing talent.\n\nThe bank confirmed his death in a statement Tuesday morning and named Marlene Lenarduzzi, the bank’s chief risk officer, as interim CEO effective immediately.\n\nMr. Moor “built a team that reflects the very best of his values – genuine, kind, capable – and leaves behind not just a legacy, but a foundation for continue"
  },
  {
    "title": "Pound touches near 4-year high as Trump rattles dollar",
    "url": "https://www.bbc.com/news/articles/cjrlyve8dq8o",
    "text": "Pound hits near 4-year high as Trump rattles dollar\n\n59 minutes ago Share Save Dearbail Jordan Business reporter, BBC News Share Save\n\nGetty Images\n\nThe pound briefly hit its highest level against the dollar for almost four years after markets were unnerved by a report that US President Donald Trump could bring forward the naming of the new head of the US central bank. Sterling rose above $1.37, which is the strongest since October 2021. The dollar weakened after the Wall Street Journal reported Trump had considered naming Jerome Powell's replacement as head of the Federal Reserve by September or October. The US Fed is independent from the government and Mr Powell chairs a committee that decides on interest rates which have remained unchanged this year, prompting a series of angry outburst"
  },
  {
    "title": "The US economy shrank much faster in the first quarter than previously reported",
    "url": "https://www.cnn.com/2025/06/26/economy/us-gdp-q1-final",
    "text": "Washington CNN —\n\nA deluge of economic data released Thursday should have provided a clearer picture of how the US economy is faring in the face of President Donald Trump’s massive policy shifts. But the latest numbers were a mixed bag, leaving economists still scratching their heads.\n\nGross domestic product, the broadest measure of economic output, registered an annualized rate of -0.5% from January through March, the Commerce Department said Thursday in its third and final estimate. That’s worse than the 0.2% decline reported in the second estimate. GDP is adjusted for seasonal swings and inflation.\n\nThe latest estimate showed that consumer spending — the lifeblood of the US economy — was tepid in the beginning of the year. Spending in the first quarter grew at a rate of just 0.5%, down"
  },
  {
    "title": "Donald Trump’s tariff wars deal a blow! US economy shrinks 0.5%; worse than estimates",
    "url": "https://timesofindia.indiatimes.com/business/international-business/donald-trumps-tariff-wars-deal-a-blow-us-economy-shrinks-0-5-worse-than-estimates/articleshow/122093162.cms",
    "text": "Markets Cheer As Federal Court Strikes Down Trump’s Global Tariffs In Unanimous Ruling\n\nHow did imports drag down US GDP ?\n\nThe US economy shrank by 0.5% on an annual basis in the first quarter of 2025, as President Donald Trump’s trade war prompted a rush of imports, disrupting businesses, the commerce department announced on Thursday.This unexpected sharp downgrade from an earlier estimate of a 0.2% decline, reflects the economic fallout from Trump’s trade policies, which saw American firms scrambling to import goods before tariffs could take effect.The surge in imports, up by a staggering 37.9%, the fastest pace since 2020, dragged down the GDP by almost 4.7 percentage points, AP reported.This contraction marks the first quarterly decline in the US economy in three years, reversing the"
  }
]